snlkuharlocal/src/Documents/ПрайсЛист/ПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрайсЛист</name>
  <basedOn>Document.ЗаявкаНаУстановкуЦен</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаУстановкуЦен</types>
      <types>DocumentRef.РасчетЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/ТипыЦен/ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦен</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрядностьЦены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Sale</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закупочный_ФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеФР</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНаЭлементы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретНаИспользованиеВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ПрайсЛист/ManagerModule.bsl
Процедура ОтправкаОповещенийОбИзмененииПрайсЛиста(ДокументСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.ТипЦен) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипЦен", ДокументСсылка.ТипЦен);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыЦенПользователи.Пользователь.ФизЛицо.ЕМэйл КАК ЕМэйл
	|ИЗ
	|	Справочник.ТипыЦен.Пользователи КАК ТипыЦенПользователи
	|ГДЕ
	|	ТипыЦенПользователи.Ссылка = &ТипЦен
	|	И (ВЫРАЗИТЬ(ТипыЦенПользователи.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100))) <> """"";
	
	МассивАдресов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЕМэйл");
	
	Если МассивАдресов.Количество() > 0 Тогда
		
		СписокПолучателей = Новый СписокЗначений;
		Для Каждого Адрес ИЗ МассивАдресов Цикл
			СписокПолучателей.Добавить(Адрес);	
		КонецЦикла;
		
		// Кухарь А.Ю. 21.03.2022 начало
		// 		ТемаПисьма = "Изменен " + Строка(ДокументСсылка);
		//ТекстПисьма = "Изменен " + Строка(ДокументСсылка);
		// Кухарь А.Ю.  28.11.2024 начало
		//ТекстПисьма = "Изменен прайс с типом цен " + ДокументСсылка.ТипЦен;
		//ТемаПисьма = "Изменен прайс с типом цен " + ДокументСсылка.ТипЦен; 
		ТекстПисьма = "Изменен прайс "+Строка(ДокументСсылка)+" с типом цен " + ДокументСсылка.ТипЦен;
		ТемаПисьма = "Изменен прайс "+Строка(ДокументСсылка)+" с типом цен " + ДокументСсылка.ТипЦен; 	
		// Кухарь А.Ю.  28.11.2024 конец
		
		// Кухарь А.Ю. 21.03.2022 конец

		СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма, ДокументСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьПерезаписатьПрайсЛист(ДокументПрайс = Неопределено, ТаблицаТоваров, ДополнительныеРеквизиты = Неопределено) Экспорт
	
	НовыйПрайс = ?(ДокументПрайс = Неопределено, Документы.ПрайсЛист.СоздатьДокумент(), ДокументПрайс.ПолучитьОбъект());
	
	НовыйПрайс.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
	НовыйПрайс.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	НовыйПрайс.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	НовыйПрайс.Автор = ПараметрыСеанса.Пользователь;
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			УстановитьРеквизитШапки(НовыйПрайс, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ДополнительныеРеквизиты.Свойство("Дата") Тогда
		НовыйПрайс.Дата = ТекущаяДата();
	КонецЕсли;
	Если НЕ ДополнительныеРеквизиты.Свойство("Дата2") Тогда
		НовыйПрайс.Дата2 = ТекущаяДата() + 365*24*3600;
	КонецЕсли;
	
	УстановитьНомерДокументаКлиентСервер(НовыйПрайс);
	
	Попытка
		НовыйПрайс.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		НовыйПрайс.Записать(РежимЗаписиДокумента.Запись);
		Если НовыйПрайс.Ссылка = Документы.ПрайсЛист.ПустаяСсылка() Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецПопытки;
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаТоваров Цикл
		
		Запись = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
		
		Запись.Период = ТекущаяДата();                           
		Запись.ТипЦен = ДополнительныеРеквизиты.ТипЦен;
		
		Запись.Номенклатура = СтрокаТЧ.Номенклатура;
		Запись.Брэнд = СтрокаТЧ.Номенклатура.Родитель;
		Запись.Прайс = НовыйПрайс.Ссылка;
		Запись.Цена = СтрокаТЧ.Цена;
		
		Уровень = СтрокаТЧ.Номенклатура.Уровень();
		Если Уровень = 0 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура;                                    
		ИначеЕсли Уровень = 1 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура.Родитель;                                             
			Запись.Брэнд = СтрокаТЧ.Номенклатура;                                           
		ИначеЕсли Уровень = 2 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура.Родитель.Родитель;
			Запись.Брэнд = СтрокаТЧ.Номенклатура.Родитель;
			Запись.Модель = СтрокаТЧ.Номенклатура;
		ИначеЕсли Уровень = 3 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура.Родитель.Родитель.Родитель;
			Запись.Брэнд = СтрокаТЧ.Номенклатура.Родитель.Родитель;
			Запись.Модель = СтрокаТЧ.Номенклатура.Родитель;                      
		КонецЕсли;
		
		Запись.Записать();
		
	КонецЦикла;
	
	Возврат НовыйПрайс.Ссылка;
	
КонецФункции
